Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Methods
The ReferenceModel type exposes the following members.
Methods
Name | Description
Delete
 Reference model objects cannot be deleted.
 (Overrides DatabaseObject.Delete().)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
 (Inherited from DrawingObject.)
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetRelatedObjects()
 Gets the related objects of the current object.
 (Inherited from DrawingObject.)
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
 (Inherited from DrawingObject.)
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
 (Inherited from DrawingObject.)
Insert
 Reference model objects cannot be inserted.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
Modify
 Modifies the reference model object.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the reference model object.
 (Overrides DatabaseObject.Select().)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Inherited from DrawingObject.)
Top
See Also
Reference
ReferenceModel Class
Tekla.Structures.Drawing Namespace